misurazioni/artillery-discount-rest.yml
config:
  target: "http://localhost:8080" # Cambia con la tua base URL REST
  phases:
    - duration: 60   # Testa per 60 secondi
      arrivalRate: 5 # 5 utenti virtuali al secondo, puoi aumentare
  payload:
    path: "products.csv"
    fields:
      - productId
      - oldPrice
      - newPrice
  defaults:
    headers:
      Authorization: "Bearer {{ token }}" # Imposta se serve JWT
scenarios:
  - name: Applica sconto a prodotto low stock
    flow:
      - patch:
          url: "/products/{{ productId }}"
          json:
            price: "{{ newPrice }}"
      - think: 1 # Aspetta 1 secondo prima del prossimo